stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WB5MM-DK/Applications/Matter/Temperature-Measure-App/System/Src/app_entry.cpp
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : app_entry.c
 * Description        : Entry application source file for STM32WPAN Middleware.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2019-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "main.h"
#include "app_entry.h"
#include "app_thread.h"
#include "app_conf.h"
#include "hw_conf.h"
#include "cmsis_os.h"
#include "stm_logging.h"
#include "dbg_trace.h"
#include "shci_tl.h"
#include "stm32_lpm.h"
#include "app_ble.h"
#include "app_debug.h"
#include "shci.h"


#ifdef USE_STM32WB5M_DK
#if (CFG_LCD_SUPPORTED == 1)
#include "stm32wb5mm_dk_lcd.h"
#include "stm32_lcd.h"
#include "ssd1315.h"
#endif /* (CFG_LCD_SUPPORTED == 1) */
#include "stm_ext_flash.h"
#endif /* USE_STM32WB5M_DK */

#include "AppTask.h"
#include "flash_wb.h"  
#include "STM32FreeRtosHooks.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "main.h"
#include "otp.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
/* POOL_SIZE = 2(TL_PacketHeader_t) + 258 (3(TL_EVT_HDR_SIZE) + 255(Payload size)) */
#define POOL_SIZE (CFG_TLBLE_EVT_QUEUE_LENGTH*4*DIVC(( sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE ), 4))
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

extern RTC_HandleTypeDef hrtc; /**< RTC handler declaration */
#ifdef __cplusplus
extern "C" {
#endif

PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
uint8_t g_ot_notification_allowed = 0U;
/* Global variables ----------------------------------------------------------*/

/* Global function prototypes -----------------------------------------------*/
#if(CFG_DEBUG_TRACE != 0)
size_t DbgTraceWrite(int handle, const unsigned char *buf, size_t bufSize);
#endif

/* USER CODE BEGIN GFP */
osMutexId_t MtxShciId;
osSemaphoreId_t SemShciId;
osThreadId_t ShciUserEvtProcessId;
osThreadId_t OsPushButtonProcessId;

#if (ENABLE_IWDG_SUPPORT == 1)
osThreadId_t OsIWDSBSFUId;
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

const osThreadAttr_t ShciUserEvtProcess_attr = { .name = CFG_SHCI_USER_EVT_PROCESS_NAME, .attr_bits = CFG_SHCI_USER_EVT_PROCESS_ATTR_BITS, .cb_mem =
CFG_SHCI_USER_EVT_PROCESS_CB_MEM, .cb_size = CFG_SHCI_USER_EVT_PROCESS_CB_SIZE, .stack_mem = CFG_SHCI_USER_EVT_PROCESS_STACK_MEM, .stack_size =
		CFG_SHCI_USER_EVT_PROCESS_STACK_SIZE, .priority = CFG_SHCI_USER_EVT_PROCESS_PRIORITY };

const osThreadAttr_t PushButtonProcess_attr = { .name = CFG_PUSH_BUTTON_EVT_PROCESS_NAME, .attr_bits = CFG_PUSH_BUTTON_EVT_PROCESS_ATTR_BITS,
		.cb_mem = CFG_PUSH_BUTTON_EVT_PROCESS_CB_MEM, .cb_size = CFG_PUSH_BUTTON_EVT_PROCESS_CB_SIZE, .stack_mem =
		CFG_PUSH_BUTTON_EVT_PROCESS_STACK_MEM, .stack_size = CFG_PUSH_BUTTON_EVT_PROCESS_STACK_SIZE, .priority =
		CFG_PUSH_BUTTON_EVT_PROCESS_PRIORITY };

#if (ENABLE_IWDG_SUPPORT == 1)
const osThreadAttr_t IWDSBSFU_attr = { .name = CFG_IWD_SBSFU_EVT_PROCESS_NAME, .attr_bits =
        CFG_IWD_SBSFU_EVT_PROCESS_ATTR_BITS, .cb_mem =
		CFG_IWD_SBSFU_EVT_PROCESS_CB_MEM, .cb_size = CFG_IWD_SBSFU_EVT_PROCESS_CB_SIZE, .stack_mem =
		CFG_IWD_SBSFU_EVT_PROCESS_STACK_MEM, .stack_size = CFG_IWD_SBSFU_EVT_PROCESS_STACK_SIZE, .priority =
		CFG_IWD_SBSFU_EVT_PROCESS_PRIORITY };
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

/* USER CODE END GFP */

/* Private functions prototypes-----------------------------------------------*/
static void Reset_Device(void); 
#if (CFG_HW_RESET_BY_FW == 1)
static void Reset_BackupDomain(void);
static void Reset_IPCC(void);
#endif /* CFG_HW_RESET_BY_FW == 1*/
static void Config_HSE(void);

static void System_Init(void);
static void Init_Smps(void);
static void Init_Exti(void);
static void Init_Rtc(void);

static void SystemPower_Config(void);
static void appe_Tl_Init(void);
static void APPE_SysStatusNot(SHCI_TL_CmdStatus_t status);
static void APPE_SysUserEvtRx(void *pPayload);
static void APPE_SysEvtReadyProcessing(void);
static void APPE_SysEvtError(SCHI_SystemErrCode_t ErrorCode);
static void Init_Debug(void);

static void ShciUserEvtProcess(void *argument);
static void PushButtonEvtProcess(void *argument);

#if (ENABLE_IWDG_SUPPORT == 1)
static void IWDSBSFUEvtProcess(void *argument);
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

/* USER CODE BEGIN PFP */
static void Led_Init(void);
static void Button_Init(void);
#if (CFG_HW_EXTPA_ENABLED == 1)
static void ExtPA_Init( void );
#endif
/* USER CODE END PFP */

//Callback function to handle pushbutton to apptask
PushButtonCallback PbCb = NULL;

void APP_ENTRY_PBSetReceiveCallback(PushButtonCallback aCallback) {
	PbCb = aCallback;
}

/* Functions Definition ------------------------------------------------------*/
void APPE_Config(void)
{
   /**
    * The OPTVERR flag is wrongly set at power on
    * It shall be cleared before using any HAL_FLASH_xxx() api
    */
   __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);
   
   /**
    * Reset some configurations so that the system behave in the same way
    * when either out of nReset or Power On
    */
   Reset_Device();

   /* Configure HSE Tuning */
   Config_HSE();
   
   return;
}

void APPE_Init(void) 
{

