stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WB5MM-DK/Applications/Matter/Temperature-Measure-App/System/Src/app_entry.cpp
#if (ENABLE_IWDG_SUPPORT == 1)
    /* Reconfigure IWDG for user application usage. 
     * The SecureBoot (if used) configured the IWDG for its own purpose.
	 * Once running, IWDG cannot be stopped. UserApp must refresh it periodically before it causes a reset.
	 * We re-use IWDG to monitor application crashes, but we need to increase IWDG counter value.
	 * As IWDG registers are protected, it is required first to write a specific value in the KR register.
     *   LSI_freq = 32000 Hz
	 *   IWDG prescaler (IWDG_PR) is applied to LSI.
	 *   Reload register (IWDG_RLR) is a 12-bit register (maximum value = 0xFFF).
	 *   IWDG timeout = IWDG_RSR * IWDG_PR / 32000
	 * Settings for a 25 sec timeout :
	*/
    WRITE_REG(IWDG->KR, IWDG_KEY_WRITE_ACCESS_ENABLE); /* enable modification of IWDG registers */
    WRITE_REG(IWDG->PR, IWDG_PRESCALER_256); 
    WRITE_REG(IWDG->RLR, 0xC35);
	/* refresh the IWDG */
    WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);
#endif /* (ENABLE_IWDG_SUPPORT == 1)  */

	freertos_mbedtls_init();
	
	/* < System initialization */
	System_Init();       

	/* Configure the system Power Mode */
	SystemPower_Config();

	/* Initialize the TimerServer */
	HW_TS_Init(hw_ts_InitMode_Full, &hrtc);

	/* USER CODE BEGIN APPE_Init_1 */
	/* initialize debugger module if supported and debug trace if activated */
	Init_Debug();

	/* FLASH init */
#ifdef USE_STM32WB5M_DK
	STM_EXT_FLASH_Init();
#endif /* USE_STM32WB5M_DK */

	NM_Init();
	
	APP_DBG("FW info :");
    APP_DBG("**********************************************************");
    APP_DBG("PRODUCT NAME : " PRODUCT_NAME );
    APP_DBG("VENDOR NAME : " VENDOR_NAME );
#if defined(USE_STM32WB5M_DK)
    APP_DBG("HARDWARE : STM32WB5MM-DK" );
#elif defined(USE_STM32WBXX_NUCLEO)
 	APP_DBG("HARDWARE : STM32WBXX_NUCLEO" );
#else
 	APP_DBG("HARDWARE : UNSPECIFIED" );
#endif
    APP_DBG("SOFTWARE : X-CUBE-MATTER release revision " X_CUBE_MATTER_VERSION );
    APP_DBG("Embedded SW components :");
    APP_DBG("- Matter SDK version : " MATTER_SDK_VERSION );



	/* init CPU2 debug */
    APPD_Init();

	/**
	 * The Standby mode should not be entered before the initialization is over
	 * The default state of the Low Power Manager is to allow the Standby Mode so an request is needed here
	 */
	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);

	OsPushButtonProcessId = osThreadNew(PushButtonEvtProcess, NULL, &PushButtonProcess_attr);
#if (ENABLE_IWDG_SUPPORT == 1)
    OsIWDSBSFUId = osThreadNew(IWDSBSFUEvtProcess, NULL, &IWDSBSFU_attr);
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

	Led_Init();
	Button_Init();



	/* USER CODE END APPE_Init_1 */
	/* Initialize all transport layers and start CPU2 which will send back a ready event to CPU1 */
	appe_Tl_Init();

	/**
	 * From now, the application is waiting for the ready event ( VS_HCI_C2_Ready )
	 * received on the system channel before starting the Stack
	 * This system event is received with APPE_SysUserEvtRx()
	 */
	/* USER CODE BEGIN APPE_Init_2 */
#if (CFG_HW_EXTPA_ENABLED == 1)
  ExtPA_Init();
#endif

	/* USER CODE END APPE_Init_2 */
	return;
}

#ifdef  USE_STM32WBXX_NUCLEO
void APP_ENTRY_LedBlink(Led_TypeDef Led, uint8_t LedStatus) {
	if(LedStatus == 1){
		BSP_LED_On(Led);
	}else {
		BSP_LED_Off(Led);
	}
}
#endif /* USE_STM32WBXX_NUCLEO */


void APPE_Lcd_Init(void)
{
#ifdef USE_STM32WB5M_DK
#if (CFG_LCD_SUPPORTED == 1)
    BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);
    /* Set LCD Foreground Layer  */
    BSP_LCD_DisplayOn(0);
    UTIL_LCD_SetFuncDriver(&LCD_Driver); /* SetFunc before setting device */
    UTIL_LCD_SetDevice(0); /* SetDevice after funcDriver is set */
    UTIL_LCD_Clear(SSD1315_COLOR_BLACK);
    BSP_LCD_Refresh(0);
    UTIL_LCD_SetFont(&Font12);
    /* Set the LCD Text Color */
    UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
    UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
    UTIL_LCD_Clear(SSD1315_COLOR_BLACK);
    BSP_LCD_Refresh(0);

    UTIL_LCD_DisplayStringAt(0, 0, (uint8_t*) PRODUCT_NAME, CENTER_MODE);
    BSP_LCD_Refresh(0);

#endif /* (CFG_LCD_SUPPORTED == 1) */
#endif /* USE_STM32WB5M_DK */
}
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Reset_Device(void) {
#if ( CFG_HW_RESET_BY_FW == 1 )
	Reset_BackupDomain();

	Reset_IPCC();
#endif

	return;
}

#if (CFG_HW_RESET_BY_FW == 1)
static void Reset_BackupDomain(void) {
	if ((LL_RCC_IsActiveFlag_PINRST() != FALSE)
			&& (LL_RCC_IsActiveFlag_SFTRST() == FALSE)) {
		HAL_PWR_EnableBkUpAccess(); /**< Enable access to the RTC registers */

		/**
		 *  Write twice the value to flush the APB-AHB bridge
		 *  This bit shall be written in the register before writing the next one
		 */
		HAL_PWR_EnableBkUpAccess();

		__HAL_RCC_BACKUPRESET_FORCE();
		__HAL_RCC_BACKUPRESET_RELEASE();
	}

	return;
}

static void Reset_IPCC(void) {
	LL_AHB3_GRP1_EnableClock(LL_AHB3_GRP1_PERIPH_IPCC);

	LL_C1_IPCC_ClearFlag_CHx(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_ClearFlag_CHx(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableTransmitChannel(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableTransmitChannel(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableReceiveChannel(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableReceiveChannel(
	IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3
					| LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	return;
}
#endif /* CFG_HW_RESET_BY_FW == 1 */

static void Config_HSE(void)
{
  OTP_ID0_t * p_otp;

  /**
   * Read HSE_Tuning from OTP
   */
  p_otp = (OTP_ID0_t *) OTP_Read(0);
  if (p_otp)
  {
    LL_RCC_HSE_SetCapacitorTuning(p_otp->hse_tuning);
  }

  return;
}

static void System_Init(void)
{
  Init_Smps();

  Init_Exti();

  Init_Rtc();

  return;
}

static void Init_Smps(void)
{
#if (CFG_USE_SMPS != 0)
  /**
   *  Configure and enable SMPS
   *
   *  The SMPS configuration is not yet supported by CubeMx
   *  when SMPS output voltage is set to 1.4V, the RF output power is limited to 3.7dBm
   *  the SMPS output voltage shall be increased for higher RF output power
   */
  LL_PWR_SMPS_SetStartupCurrent(LL_PWR_SMPS_STARTUP_CURRENT_80MA);
  LL_PWR_SMPS_SetOutputVoltageLevel(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40);
  LL_PWR_SMPS_Enable();
#endif /* CFG_USE_SMPS != 0 */

  return;
}

