stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WB5MM-DK/Applications/Matter/Temperature-Measure-App/System/Src/app_entry.cpp
static void Init_Exti(void)
{
  /* Enable IPCC(36), HSEM(38) wakeup interrupts on CPU1 */
  //LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_36 | LL_EXTI_LINE_38);

  /* Disable all wakeup interrupt on CPU1  except LPUART(25), IPCC(36), HSEM(38) */
  LL_EXTI_DisableIT_0_31((~0) & (~(LL_EXTI_LINE_25)));
  LL_EXTI_DisableIT_32_63((~0) & (~(LL_EXTI_LINE_36 | LL_EXTI_LINE_38)));
  return;
}

static void Init_Rtc(void)
{
  /* Disable RTC registers write protection */
  LL_RTC_DisableWriteProtection(RTC);

  LL_RTC_WAKEUP_SetClock(RTC, CFG_RTC_WUCKSEL_DIVIDER);

  /* Enable RTC registers write protection */
  LL_RTC_EnableWriteProtection(RTC);

  return;
}

static void Init_Debug(void) {
#if (CFG_DEBUGGER_SUPPORTED == 1)
	/**
	 * Keep debugger enabled while in any low power mode
	 */
	HAL_DBGMCU_EnableDBGSleepMode();

	/* Enable debugger EXTI lines */
	LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);
	LL_C2_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);

#else
  /* Disable debugger EXTI lines */
  LL_EXTI_DisableIT_32_63(LL_EXTI_LINE_48);
  LL_C2_EXTI_DisableIT_32_63(LL_EXTI_LINE_48);

  GPIO_InitTypeDef gpio_config = {0};

  gpio_config.Pull = GPIO_NOPULL;
  gpio_config.Mode = GPIO_MODE_ANALOG;

  gpio_config.Pin = GPIO_PIN_15 | GPIO_PIN_14 | GPIO_PIN_13;
  __HAL_RCC_GPIOA_CLK_ENABLE();
  HAL_GPIO_Init(GPIOA, &gpio_config);
  __HAL_RCC_GPIOA_CLK_DISABLE();

  gpio_config.Pin = GPIO_PIN_4 | GPIO_PIN_3;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  HAL_GPIO_Init(GPIOB, &gpio_config);
  __HAL_RCC_GPIOB_CLK_DISABLE();

  /**
   * Do not keep debugger enabled while in any low power mode
   */
  HAL_DBGMCU_DisableDBGSleepMode();
  HAL_DBGMCU_DisableDBGStopMode();
  HAL_DBGMCU_DisableDBGStandbyMode();
#endif /* (CFG_DEBUGGER_SUPPORTED == 1) */

#if(CFG_DEBUG_TRACE != 0)
	DbgTraceInit();
#endif

	return;
}

/**
 * @brief  Configure the system for power optimization
 *
 * @note  This API configures the system to be ready for low power mode
 *
 * @param  None
 * @retval None
 */
static void SystemPower_Config(void) {
	// Before going to stop or standby modes, do the settings so that system clock and IP80215.4 clock
	// start on HSI automatically
	LL_RCC_HSI_EnableAutoFromStop();

	/**
	 * Select HSI as system clock source after Wake Up from Stop mode
	 */
	LL_RCC_SetClkAfterWakeFromStop(LL_RCC_STOP_WAKEUPCLOCK_HSI);

	/* Initialize low power manager */
	UTIL_LPM_Init();

	/* Disable low power mode until INIT is complete */
	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);
	UTIL_LPM_SetStopMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);

	/* Enable RAM1 (because OT instance.o is located here for Concurrent Mode */
	LL_C2_AHB1_GRP1_EnableClock(LL_C2_AHB1_GRP1_PERIPH_SRAM1);
	LL_C2_AHB1_GRP1_EnableClockSleep(LL_C2_AHB1_GRP1_PERIPH_SRAM1);

	return;
}

static void appe_Tl_Init(void) {

	/**< Reference table initialization */
	TL_Init();

    MtxShciId = osMutexNew(NULL);
	SemShciId = osSemaphoreNew(1, 0, NULL); /*< Create the semaphore and make it busy at initialization */

    /** FreeRTOS system task creation */
    ShciUserEvtProcessId = osThreadNew(ShciUserEvtProcess, NULL, &ShciUserEvtProcess_attr);

	return;
}

static void APPE_SysStatusNot(SHCI_TL_CmdStatus_t status) {
    switch (status) {
    case SHCI_TL_CmdBusy:
        osMutexAcquire(MtxShciId, osWaitForever);
        break;

    case SHCI_TL_CmdAvailable:
        osMutexRelease(MtxShciId);
        break;

    default:
        break;
    }
	return;
}

/**
 * The type of the payload for a system user event is tSHCI_UserEvtRxParam
 * When the system event is both :
 *    - a ready event (subevtcode = SHCI_SUB_EVT_CODE_READY)
 *    - reported by the FUS (sysevt_ready_rsp == FUS_FW_RUNNING)
 * The buffer shall not be released
 * ( eg ((tSHCI_UserEvtRxParam*)pPayload)->status shall be set to SHCI_TL_UserEventFlow_Disable )
 * When the status is not filled, the buffer is released by default
 */
static void APPE_SysUserEvtRx(void *pPayload) {
	TL_AsynchEvt_t *p_sys_event;
	p_sys_event = (TL_AsynchEvt_t*) (((tSHCI_UserEvtRxParam*) pPayload)->pckt->evtserial.evt.payload);

	switch (p_sys_event->subevtcode) {
	case SHCI_SUB_EVT_CODE_READY:
		APPE_SysEvtReadyProcessing();
		break;

	case SHCI_SUB_EVT_ERROR_NOTIF:
		APPE_SysEvtError((SCHI_SystemErrCode_t) (p_sys_event->payload[0]));
		break;

	default:
		break;
	}
	return;
}

/**
 * @brief Notify a system error coming from the M0 firmware
 * @param  ErrorCode  : errorCode detected by the M0 firmware
 *
 * @retval None
 */
static void APPE_SysEvtError(SCHI_SystemErrCode_t ErrorCode) {
	switch (ErrorCode) {
	case ERR_THREAD_LLD_FATAL_ERROR:
		APP_DBG("** ERR_THREAD : LLD_FATAL_ERROR \n")
		;
		break;

	case ERR_THREAD_UNKNOWN_CMD:
		APP_DBG("** ERR_THREAD : UNKNOWN_CMD \n")
		;
		break;

	default:
		APP_DBG("** ERR_THREAD : ErroCode=%d \n", ErrorCode)
		;
		break;
	}
	return;
}

static void APPE_SysEvtReadyProcessing(void) {
	/* Traces channel initialization */
    APPD_EnableCPU2();

	/* Configuration to CPU2 */
	SHCI_C2_CONFIG_Cmd_Param_t config_param = {0};
	uint32_t Ot_NVMAddr = 0;

	/* In the Context of Dynamic Concurrent mode, the Init and start of each stack must be split and executed
	 * in the following order :
     * APP_BLE_Init_Dyn_1()    : BLE Stack Init until it's ready to start ADV
     * APP_THREAD_Init_Dyn_1() : Thread Stack Init until it's ready to be configured (default channel, PID, etc...)
     * APP_THREAD_Init_Dyn_2() : Thread Stack configuration (default channel, PID, etc...) to be able to start scanning
     *                           or joining a Thread Network
	 */

    APP_THREAD_CheckWirelessFirmwareInfo();

	/* Set the address that will be used by OT stack for NVM data management */
	if(NM_GetOtNVMAddr(&Ot_NVMAddr) == NVM_OK){
		config_param.ThreadNvmRamAddress = Ot_NVMAddr;
		(void)SHCI_C2_Config(&config_param);
	}

	APP_DBG("1- Initialisation of BLE Stack...");
	APP_BLE_Init_Dyn_1();

	APP_DBG("2- Initialisation of OpenThread Stack...");
    APP_THREAD_Init_Dyn_1();
    APP_THREAD_Init_Dyn_2();

    APP_DBG("* GetAppTask().InitMatter();*");
	GetAppTask().InitMatter();

    APP_DBG("* GetAppTask().StartAppTask();*");
	GetAppTask().StartAppTask();

    APP_DBG("Initialisation finished");

#if ( CFG_LPM_SUPPORTED == 1)
  /* Thread stack is initialized, low power mode can be enabled */
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
  UTIL_LPM_SetStopMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
#endif

	return;
}


static void Led_Init(void) {
#if (CFG_LED_SUPPORTED == 1U)
	/**
	 * Leds Initialization
	 */

#ifdef  USE_STM32WBXX_NUCLEO
	BSP_LED_Init(LED_BLUE);
	BSP_LED_Init(LED_GREEN);
	BSP_LED_Init(LED_RED);
#endif /* USE_STM32WBXX_NUCLEO */

#endif

	return;
}

static void Button_Init(void) {

#if (CFG_BUTTON_SUPPORTED == 1U)
	/**
	 * Button Initialization
	 */

#ifdef  USE_STM32WBXX_NUCLEO
	BSP_PB_Init(BUTTON_SW1, BUTTON_MODE_EXTI);
	BSP_PB_Init(BUTTON_SW2, BUTTON_MODE_EXTI);
	BSP_PB_Init(BUTTON_SW3, BUTTON_MODE_EXTI);
#endif /* USE_STM32WBXX_NUCLEO */

#ifdef USE_STM32WB5M_DK
	BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_EXTI);
    BSP_PB_Init(BUTTON_USER2, BUTTON_MODE_EXTI);
#endif /* USE_STM32WB5M_DK */	
    
#endif

	return;
}

