stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WB5MM-DK/Applications/Matter/Temperature-Measure-App/System/Src/app_entry.cpp
#if (CFG_HW_EXTPA_ENABLED == 1)
static void ExtPA_Init( void )
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  // configure the GPIO PB0 in AF6 to be used as RF_TX_MOD_EXT_PA
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF6_RF_DTB0;
  GPIO_InitStruct.Pin = GPIO_EXT_PA_TX_PIN;
  HAL_GPIO_Init(GPIO_EXT_PA_TX_PORT, &GPIO_InitStruct);

  // configure the GPIO which will be managed by M0 stack to enable Ext PA
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Pin = GPIO_EXT_PA_EN_PIN;
  HAL_GPIO_Init(GPIO_EXT_PA_EN_PORT, &GPIO_InitStruct);

  // Indicate to M0 which GPIO must be managed
  SHCI_C2_ExtpaConfig((uint32_t)GPIO_EXT_PA_EN_PORT, GPIO_EXT_PA_EN_PIN, EXT_PA_ENABLED_HIGH, EXT_PA_ENABLED);
}
#endif /* CFG_HW_EXTPA_ENABLED */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
static void PushButtonEvtProcess(void *argument) {
	UNUSED(argument);
    uint32_t ButtonPressed = 0;

	for (;;) {
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_1 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_1 */
		ButtonPressed = osThreadFlagsWait(3, osFlagsWaitAny, osWaitForever);
		Push_Button_st Message;
#ifdef  USE_STM32WBXX_NUCLEO
        if( 1 == ButtonPressed) {
            Message.Pushed_Button = BUTTON_SW1;
            Message.State = 1;
        }
#endif /* USE_STM32WBXX_NUCLEO */

#ifdef USE_STM32WB5M_DK
        if( 1 == ButtonPressed) {
            Message.Pushed_Button = BUTTON_USER1;
            Message.State = 1;
        }
        if( 2 == ButtonPressed) {
           Message.Pushed_Button = BUTTON_USER2;
           Message.State = 2;
        }
#endif /* USE_STM32WB5M_DK */

		if (PbCb != NULL)
		{
			PbCb(&Message); //call matter callback to handle push button
		}
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_2 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_2 */
	}
}

static void ShciUserEvtProcess(void *argument) {
	UNUSED(argument);
	
	TL_MM_Config_t tl_mm_config;
	SHCI_TL_HciInitConf_t SHci_Tl_Init_Conf;

	/**< System channel initialization */
	SHci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*) &SystemCmdBuffer;
	SHci_Tl_Init_Conf.StatusNotCallBack = APPE_SysStatusNot;
	shci_init(APPE_SysUserEvtRx, (void*) &SHci_Tl_Init_Conf);

	/**< Memory Manager channel initialization */
	tl_mm_config.p_BleSpareEvtBuffer = BleSpareEvtBuffer;
	tl_mm_config.p_SystemSpareEvtBuffer = SystemSpareEvtBuffer;
	tl_mm_config.p_AsynchEvtPool = EvtPool;
	tl_mm_config.AsynchEvtPoolSize = POOL_SIZE;
	TL_MM_Init(&tl_mm_config);

	TL_Enable();

	for (;;) {
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_1 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_1 */
		osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);

		shci_user_evt_proc();
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_2 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_2 */
	}
}

#if (ENABLE_IWDG_SUPPORT == 1) 
static void IWDSBSFUEvtProcess(void *argument) {
    TickType_t xLastWakeTime;
    // Initialise the xLastWakeTime variable with the current time.
    xLastWakeTime = xTaskGetTickCount();

    for (;;) {
        // Wait for the next cycle.
        vTaskDelayUntil(&xLastWakeTime, IWD_RELOAD);
        /* If the SecureBoot configured the IWDG, UserApp must reload IWDG counter with 
         * value defined in the reload register. */
        WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);
    }
}
#endif /* (ENABLE_IWDG_SUPPORT == 1)  */

void shci_notify_asynch_evt(void *pdata) {
	UNUSED(pdata);

    osThreadFlagsSet(ShciUserEvtProcessId, 1);
	return;
}

void shci_cmd_resp_release(uint32_t flag) {
	UNUSED(flag);
	osSemaphoreRelease(SemShciId);
	return;
}

void shci_cmd_resp_wait(uint32_t timeout) {

    osSemaphoreAcquire(SemShciId, pdMS_TO_TICKS(timeout));
	return;
}

/* Received trace buffer from M0 */
void TL_TRACES_EvtReceived(TL_EvtPacket_t *hcievt) {
#if(CFG_DEBUG_TRACE != 0)
	/* Call write/print function using DMA from dbg_trace */
	/* - Cast to TL_AsynchEvt_t* to get "real" payload (without Sub Evt code 2bytes),
	 - (-2) to size to remove Sub Evt Code */
	DbgTraceWrite(1U, (const unsigned char*) ((TL_AsynchEvt_t*) (hcievt->evtserial.evt.payload))->payload, hcievt->evtserial.evt.plen - 2U);
#endif /* CFG_DEBUG_TRACE */
	/* Release buffer */
	TL_MM_EvtDone(hcievt);
}
/**
 * @brief  Initialization of the trace mechanism
 * @param  None
 * @retval None
 */
#if(CFG_DEBUG_TRACE != 0)
void DbgOutputInit(void) {
#if (CFG_HW_USART1_ENABLED == 1)

	MX_USART1_UART_Init();
#endif
	return;
}

/**
 * @brief  Management of the traces
 * @param  p_data : data
 * @param  size : size
 * @param  call-back :
 * @retval None
 */
void DbgOutputTraces(uint8_t *p_data, uint16_t size, void (*cb)(void)) {
	HW_UART_Transmit_DMA(CFG_DEBUG_TRACE_UART, p_data, size, cb);

	return;
}
#endif

#ifdef  USE_STM32WBXX_NUCLEO
/**
 * @brief This function manage the Push button action
 * @param  GPIO_Pin : GPIO pin which has been activated
 * @retval None
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	switch (GPIO_Pin) {
	case BUTTON_SW1_PIN:
		APP_DBG("BUTTON 1 PUSHED !");
		osThreadFlagsSet(OsPushButtonProcessId, 1);
		break;

	case BUTTON_SW2_PIN:
		APP_DBG("BUTTON 2 PUSHED ! Not used");
		break;

	case BUTTON_SW3_PIN:
		APP_DBG("BUTTON 3 PUSHED ! Not used");
		break;

	default:
		break;
	}

	return;
}
#endif /* USE_STM32WBXX_NUCLEO */

#ifdef USE_STM32WB5M_DK
/**
 * @brief This function manage the Push button action
 * @param  GPIO_Pin : GPIO pin which has been activated
 * @retval None
 */
void BSP_PB_Callback(Button_TypeDef Button) {
    switch (Button) {
    case BUTTON_USER1:
        APP_DBG("BUTTON 1 PUSHED !");
        osThreadFlagsSet(OsPushButtonProcessId, 1);
        break;

    case BUTTON_USER2:
        APP_DBG("BUTTON 2 PUSHED !");
        osThreadFlagsSet(OsPushButtonProcessId, 2);
        break;

    default:
        break;
    }
    return;
}
#endif /* USE_STM32WB5M_DK */

#ifdef __cplusplus
}
#endif

